/*
*********************************************************************************************************
*
*	模块名称 : 字符串操作\数值转换
*	文件名称 : MyLib.c
*	版    本 : V1.3a
*	说    明 : 提供一些常用的sting、mem操作函数以及Modbus CRC16函数
*   修改记录 :
*               V1.0  2013-12-05  首版
*               V1.1  2014-06-20  增加大小端整数转换函数
*				V1.2  2015-04-06  增加 BEBufToUint32()和 LEBufToUint32()
*				V1.3  2015-10-09  增加 BcdToChar(), HexToAscll()和 AsciiToUint32()
*				V1.3a 2015-10-09  解决 HexToAscll() 函数末尾补0的BUG
*
*********************************************************************************************************
*/

#include "UserLib.h"


/*
*********************************************************************************************************
*	函 数 名: str_len
*	功能说明: 计算字符串长度.0是结束符
*	参    数: _str : 缓冲区
*	返 回 值: 无
*********************************************************************************************************
*/
int str_len(char *_str)
{
	int len = 0;

	while (*_str++) len++;
	return len;
}

/*
*********************************************************************************************************
*	函 数 名: str_cpy
*	功能说明: 复制字符串
*	参    数: tar : 目标缓冲区
*			 src : 源缓冲区
*	返 回 值: 无
*********************************************************************************************************
*/
void str_cpy(char *_tar, char *_src)
{
	do
	{
		*_tar++ = *_src;
	}
	while (*_src++);
}

/*
*********************************************************************************************************
*	函 数 名: str_cmp
*	功能说明: 字符串比较
*	参    数: s1 : 字符串1
*			  s2 : 字符串2
*	返 回 值: 0 表示相等 非0表示不等
*********************************************************************************************************
*/
int str_cmp(char * s1, char * s2)
{
	while ((*s1!=0) && (*s2!=0) && (*s1==*s2))
	{
		s1++;
		s2++;
	}
	return *s1 - *s2;
}

/*
*********************************************************************************************************
*	函 数 名: str_copy
*	功能说明: 复制字符串
*	参    数: tar : 目标缓冲区
*			 src : 源缓冲区
*	返 回 值: 无
*********************************************************************************************************
*/
void mem_set(char *_tar, char _data, int _len)
{
	while (_len--)
	{
		*_tar++ = _data;
	}
}


/*
*********************************************************************************************************
*	函 数 名: BEBufToUint16
*	功能说明: 将2字节数组(大端Big Endian次序，高字节在前)转换为16位整数
*	参    数: _pBuf : 数组
*	返 回 值: 16位整数值
*
*   大端(Big Endian)与小端(Little Endian)
*********************************************************************************************************
*/
uint16_t BEBufToUint16(uint8_t *_pBuf)
{
    return (((uint16_t)_pBuf[0] << 8) | _pBuf[1]);
}

/*
*********************************************************************************************************
*	函 数 名: LEBufToUint16
*	功能说明: 将2字节数组(小端Little Endian，低字节在前)转换为16位整数
*	参    数: _pBuf : 数组
*	返 回 值: 16位整数值
*********************************************************************************************************
*/
uint16_t LEBufToUint16(uint8_t *_pBuf)
{
    return (((uint16_t)_pBuf[1] << 8) | _pBuf[0]);
}


/*
*********************************************************************************************************
*	函 数 名: BEBufToUint32
*	功能说明: 将4字节数组(大端Big Endian次序，高字节在前)转换为16位整数
*	参    数: _pBuf : 数组
*	返 回 值: 16位整数值
*
*   大端(Big Endian)与小端(Little Endian)
*********************************************************************************************************
*/
uint32_t BEBufToUint32(uint8_t *_pBuf)
{
    return (((uint32_t)_pBuf[0] << 24) | ((uint32_t)_pBuf[1] << 16) | ((uint32_t)_pBuf[2] << 8) | _pBuf[3]);
}

/*
*********************************************************************************************************
*	函 数 名: LEBufToUint32
*	功能说明: 将4字节数组(小端Little Endian，低字节在前)转换为16位整数
*	参    数: _pBuf : 数组
*	返 回 值: 16位整数值
*********************************************************************************************************
*/
uint32_t LEBufToUint32(uint8_t *_pBuf)
{
    return (((uint32_t)_pBuf[3] << 24) | ((uint32_t)_pBuf[2] << 16) | ((uint32_t)_pBuf[1] << 8) | _pBuf[0]);
}



/*
*********************************************************************************************************
*	函 数 名: CaculTwoPoint
*	功能说明: 根据2点直线方程，计算Y值
*	参    数:  2个点的坐标和x输入量
*	返 回 值: x对应的y值
*********************************************************************************************************
*/
int32_t  CaculTwoPoint(int32_t x1, int32_t y1, int32_t x2, int32_t y2, int32_t x)
{
	return y1 + ((int64_t)(y2 - y1) * (x - x1)) / (x2 - x1);
}


/*
*********************************************************************************************************
*	函 数 名: BcdToChar
*	功能说明: 将BCD码转为ASCII字符。 比如 0x0A ==> 'A'
*	参    数: _bcd   ：输入的二进制数。必须小于16
*	返 回 值: 转换结果
*********************************************************************************************************
*/
char BcdToChar(uint8_t _bcd)
{
	if (_bcd < 10)
	{
		return _bcd + '0';
	}
	else if (_bcd < 16)
	{
		return _bcd + 'A';
	}
	else
	{
		return 0;
	}
}


/*
*********************************************************************************************************
*	函 数 名: Abs_Difference
*	功能说明: 求两数的绝对值差
*	参    数: a,b 
*	返 回 值: 计算的绝对值差
*********************************************************************************************************
*/
uint16_t Abs_Difference( uint16_t a, uint16_t b)
{
	if( a>=b ) return (a-b);
	else return (b-a);
}


/*
*********************************************************************************************************
*	函 数 名: Abs_FloatDifference
*	功能说明: 求两数的绝对值差
*	参    数: a,b 
*	返 回 值: 计算的绝对值差
*********************************************************************************************************
*/
float Abs_FloatDifference( float a, float b)
{
	if( a>=b ) return (a-b);
	else return (b-a);
}


/*
*********************************************************************************************************
*	函 数 名: SeekMax
*	功能说明: 在指定区域搜索最大值
*	参    数: *p 数据指针		num 数据个数 
*	返 回 值: 计算的绝对值差
*********************************************************************************************************
*/
uint16_t SeekMax( uint16_t *p, uint16_t num )
{
	uint16_t i,lmax=0;
	for(i=0;i<num;i++)	if( p[i]>lmax )	lmax = p[i];
	return lmax;
}


/*
*********************************************************************************************************
*	函 数 名: SeekMin
*	功能说明: 在指定区域搜索最大值
*	参    数: *p 数据指针		num 数据个数 
*	返 回 值: 计算的绝对值差
*********************************************************************************************************
*/
uint16_t SeekMin( uint16_t *p, uint16_t num )
{
	uint16_t i,lmin=0xFFFF;
	for(i=0;i<num;i++)	if( p[i]<lmin )	lmin = p[i];
	return lmin;
}


/*
*********************************************************************************************************
*	函 数 名: AvrFilter,*****未验证
*	功能说明: 均值滤波,将数组中每一个数值换算成相邻depth个数值的均值
*	参    数: *_src 源指针;  _len 数据长度;		*_tar 目标指针;		_depth 滤波深度
*	返 回 值: 无
*********************************************************************************************************
*/
void AvrFilter( uint16_t *_src, uint16_t _len, uint16_t *_tar, uint8_t _depth )
{
	uint16_t  i,j,d;
	uint8_t		forward,backward;
	uint32_t  temp;
	
	if( _depth<2 )	return;
	
	if( _depth%2==0 ) { forward = _depth/2-1; forward = _depth/2; }
	else							{ forward = _depth/2; forward = _depth/2; }
	
	for( i=0;i<_len;i++ )
	{
		temp = 0;
		d = _depth;
		for(j=i-forward;j<i+backward;j++)
		{
			if(j>0x8000 || j>=_len)	d--;	//超出数组范围,不加,除数减1
			else temp += _src[i];
		}
		_tar[i] = temp/d;
	}
}



/*
*********************************************************************************************************
*	函 数 名: AbsFilter
*	功能说明: 绝对值过滤,将数组中小于门限的数值全部清零
*	参    数: *_src 源指针;  _len 数据长度;	_percent 门限,相对于最大值的百分比;	*_tar 目标指针
*	返 回 值: 无
*********************************************************************************************************
*/
void AbsFilter( uint16_t *_src, uint16_t _len, uint8_t _percent, uint16_t *_tar )
{
	uint16_t  i,max,threshold;
	
	if(_percent>100)	return;
	
	max = SeekMax( _src, _len );
	threshold = max*_percent/100;
	
	for( i=0;i<_len;i++ )
	{
		if( _src[i]>=threshold )	_tar[i] = _src[i];
		else _tar[i] = 0;
	}	
}



/*
*********************************************************************************************************
*	函 数 名: InsertSort
*	功能说明: 插入排序
*	形    参: *arr 需排序的数组;	size 数组长度; 
*	返 回 值: 小值
*********************************************************************************************************
*/
void	InsertSort( uint16_t *arr, uint16_t size )
{
	int end = 0;
	int i = 0;
	uint16_t temp;
	
	for( i=0;i<size-1;i++ )
	{
		end  = i;
		temp = arr[end+1];
		
		while( end>=0 )
		{
			if( temp<arr[end] )
			{
				arr[end+1] = arr[end];
				end--;
			}
			else
			{
				break;
			}
		}
		arr[end+1] = temp;
	}
}


/*
*********************************************************************************************************
*	函 数 名: Swap
*	功能说明: 数据交换
*	形    参: *a 数据1;		*b 数据2; 
*	返 回 值: 无
*********************************************************************************************************
*/
void	Swap( uint16_t *a, uint16_t *b )
{
	uint16_t temp = *a;
	*a = *b;
	*b = temp;
}


/*
*********************************************************************************************************
*	函 数 名: GetMidIndex
*	功能说明: 三值取中
*	形    参: *arr 数据队列;		left 左指针;		right 右指针; 
*	返 回 值: 中值指针
*********************************************************************************************************
*/
uint16_t GetMidIndex(uint16_t* arr, uint16_t left, uint16_t right)
{
	uint16_t mid = (left + right) / 2;

	if (arr[left] < arr[right])
	{
		if( arr[mid]<arr[left] )				return left;
		else if( arr[mid]<arr[right] )	return mid;
		else														return right;
	}
	else
	{
		if( arr[mid]<arr[right] )				return right;
		else if( arr[mid]<arr[left] )		return mid;
		else 														return left;
	}
}


//挖坑法单趟排序
uint16_t PartSort( uint16_t* arr, uint16_t left, uint16_t right )
{
	uint16_t key, hole;
    
	//获取基准值，并与left交换位置
	key = GetMidIndex(arr, left, right);
	Swap( &arr[key], &arr[left] );
    
	key = arr[left];
	hole = left;
	
	while( left<right )
	{
		while( left<right && arr[right]>=key )
		{
				right--;
		}
		arr[hole] = arr[right];
		hole = right;
		
		while( left<right && arr[left]<=key )
		{
				left++;
		}
		arr[hole] = arr[left];
		hole = left;
	}
	
	arr[hole] = key;
	return hole;
}


//快速排序递归实现
void QuickSort( uint16_t* arr, uint16_t begin, uint16_t end )
{
	uint16_t key;
	
	if (begin >= end)
	{
			return;
	}
	
	// 此部分代码加入后排序出错，未完成，原因待分析    
//	//数组长度小于等于8时，调用插入排序
//	if ( end-begin+1<=8 )
//	{
//			InsertSort(arr, end-begin+1);
//			return;
//	}
	
	key = PartSort(arr, begin, end);	//单趟排序并获取基准值
	QuickSort(arr, begin, key-1);			//排左序列
	QuickSort(arr, key+1, end);				//排右序列
}


/*
*********************************************************************************************************
*	函 数 名: MedianFilter
*	功能说明: 中值滤波,计算去除最大值和最小值后的均值
*	形    参: _pStr 数据指针;  _len 数据长度
*	返 回 值: 均值
*********************************************************************************************************
*/
uint16_t MedianFilter( uint16_t *_pStr, uint16_t _len )
{
	uint16_t  i;
  uint16_t  max, min;
	uint32_t  ret ;

	max = _pStr[0];
	min = _pStr[0];

	ret = 0 ;
	for( i = 0 ; i < _len; i++)
	{
		ret += _pStr[i];
		if( max<_pStr[i])	max = _pStr[i] ;
		if( min>_pStr[i])	min = _pStr[i] ;
	}

	ret -= max;
	ret -= min;
	ret /= (_len-2);

	return (uint16_t)ret;
}



/*
*********************************************************************************************************
*	函 数 名: MedianFilter2
*	功能说明: 中值滤波,计算去除指定的大小值个数后的均值
*	形    参: _pStr 数据指针;  _len 数据长度;		_n 去除的最大值和最小值个数
*	返 回 值: 均值
*********************************************************************************************************
*/
uint16_t MedianFilter2( uint16_t *_pStr, uint16_t _len, uint16_t _n )
{
	uint16_t  i;
	uint32_t  ret;

	if( _n*2>=_len ) return 0;
	
	InsertSort( _pStr, _len );

	ret = 0 ;
	for( i = _n ; i < _len-_n; i++)
	{
		ret += _pStr[i];
	}
	
	ret /= (_len-2*_n);

	return (uint16_t)ret;
}















